[
  {
    "id": 1,
    "title": "Open Journal",
    "description": "Excited to launch my new blog platform where users can browse, save their favorite posts, and enjoy a clean UI with dark mode support. Built using React, MongoDB, and Firebase Hosting. Would love to hear your thoughts!",
    "technologies": [
      "React",
      "Tailwind CSS",
      "javaScript",
      "Firebase",
      "MongoDB",
      "Firebase",
      "Node.js",
      "Express"
    ],
    "image": "https://i.postimg.cc/FR0pTYDX/open-journal.png",
    "liveLink": "https://wondrous-paprenjak-d5a5de.netlify.app/",
    "githubLink-client": "https://github.com/ratulislam46/openjournal-client",
    "githubLink-server": "https://github.com/ratulislam46/openjournal-server",
    "challenges": [
      "Implementing a seamless dark mode toggle without layout shifts.",
      "Ensuring fast data fetching and rendering from MongoDB for smooth browsing.",
      "Managing Firebase authentication with persistent sessions across refresh.",
      "Optimizing image loading for better performance on slower networks."
    ]
  },
  {
    "id": 2,
    "title": "Delivery Tracker App",
    "description": "A full-stack parcel delivery management system where users can create parcels, riders can manage deliveries, and admins can track the overall system efficiently.",
    "technologies": [
      "React",
      "Firebase",
      "javaScript",
      "MongoDB",
      "Node.js",
      "Express",
      "Stripe"
    ],
    "image": "https://i.postimg.cc/m2ZxF4gg/Profast.png",
    "liveLink": "https://email-pass-auth-12a30.web.app/",
    "githubLink-client": "https://github.com/ratulislam46/profast-client",
    "challenges": [
      "Synchronizing real-time delivery status updates for multiple roles (user, rider, admin).",
      "Handling secure payments and refunds through Stripe integration.",
      "Designing a responsive and mobile-friendly dashboard for all device types.",
      "Implementing role-based access control without performance issues."
    ]
  },
  {
    "id": 3,
    "title": "FitNest - Fitness Booking Platform",
    "description": "FitNess is a modern fitness and training platform that allows users to explore fitness classes, book training slots, communicate via forums, and pay securely. Trainers can manage their profiles, add available slots, and track bookings. Admins have full control over the system with analytics and management tools",
    "technologies": [
      "javaScript",
      "React",
      "Firebase",
      "Node.js",
      "Express",
      "MongoDB",
      "Stripe"
    ],
    "image": "https://i.postimg.cc/VNQz3TzQ/fitness.png",
    "liveLink": "https://whimsical-praline-dd388c.netlify.app/",
    "githubLink-client": "https://github.com/ratulislam46/fitness-client",
    "challenges": [
      "Integrating real-time slot availability updates for multiple trainers.",
      "Building secure forum functionality with spam and abuse prevention.",
      "Managing booking conflicts and preventing double-booking issues.",
      "Optimizing dashboard performance with large datasets and analytics."
    ]
  }
]